In [1]:
# numpy for numerical calculations
import numpy as np
# pandas is use to manipulate the data
import pandas as pd

In [2]:
# show pandas version
pd.__version__

'0.24.2'

In [3]:
# Show numpy version
np.__version__

'1.16.2'

### 3 data structures in pandas
- series-----> 1D
- Dataframe -----> ND (N Dimentional)
- Panel

# 1. Series in Pandas

In [4]:
x = pd.Series()

In [5]:
print(x,type(x))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

In [6]:
x1 = pd.Series([10,20,30,40])

In [7]:
x1

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
x1[0]

10

In [9]:
x1[3]

40

In [10]:
# customize the index
# Must supply the same length of index as values
x2 = pd.Series([10,20,30,40], index=['Rank1', 'Rank2','Rank3','Rank4'])

In [11]:
x2

Rank1    10
Rank2    20
Rank3    30
Rank4    40
dtype: int64

In [12]:
x2['Rank1']

10

In [13]:
student_data = {1001:'Bhagwat',1002:'Pankaj',1003:'Malti',1004:'Raunak',1005:'Pranjal'}
student_data

{1001: 'Bhagwat',
 1002: 'Pankaj',
 1003: 'Malti',
 1004: 'Raunak',
 1005: 'Pranjal'}

In [14]:
print(type(student_data))

<class 'dict'>

In [15]:
# conver dict into series
x3 = pd.Series(student_data)

In [16]:
x3

1001    Bhagwat
1002     Pankaj
1003      Malti
1004     Raunak
1005    Pranjal
dtype: object

In [17]:
x3[1001]

'Bhagwat'

In [18]:
x3[1004]

'Raunak'

In [19]:
# we can also take one value for different index
x4 = pd.Series(50, index=['Rank1','Rank2','Rank3','Rank4','Rank5'])

In [20]:
x4

Rank1    50
Rank2    50
Rank3    50
Rank4    50
Rank5    50
dtype: int64

In [21]:
# create an array
arr1 = np.array([10,20,30,40,50,83,78,76,56,45])
print('Type of arr: ',type(arr1))
print('Data type of arr: ',arr1.dtype)

Type of arr:  <class 'numpy.ndarray'>
Data type of arr:  int32

In [22]:
# Convert array to Series
x5 = pd.Series(arr1)

In [23]:
x5

0    10
1    20
2    30
3    40
4    50
5    83
6    78
7    76
8    56
9    45
dtype: int32

In [24]:
# Minimum value in series
x2.min()

10

In [25]:
# Maximum value in series
x2.max()

40

In [26]:
# Median of series
x2.median()

25.0

In [27]:
# Standered Deviation of Series
x2.std()

12.909944487358056

In [28]:
# Describe Series
x2.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

# 2. Dataframe in Pandas

In [29]:
# Take dummy data of some batsman and his score
# list of lists
cricket_data = [['Virat Kohali', 13000],['Sachin Tendulkar', 18500],['Rohit Sharma',9000],['M S Dhoni',10500]]

In [30]:
# convert it to DataFrame
df = pd.DataFrame(cricket_data)

In [31]:
df

                  0      1
0      Virat Kohali  13000
1  Sachin Tendulkar  18500
2      Rohit Sharma   9000
3         M S Dhoni  10500

In [32]:
# Rename columns
df2 = pd.DataFrame(cricket_data,columns=['Batsman','ODI Runs'])

In [33]:
df2

            Batsman  ODI Runs
0      Virat Kohali     13000
1  Sachin Tendulkar     18500
2      Rohit Sharma      9000
3         M S Dhoni     10500

In [34]:
# Change Index and column name
df3 = pd.DataFrame(cricket_data,columns=['Batsman','ODI Runs'], index=['Captain','Master','Lazy Batsman','Captain'])

In [35]:
df3

                       Batsman  ODI Runs
Captain           Virat Kohali     13000
Master        Sachin Tendulkar     18500
Lazy Batsman      Rohit Sharma      9000
Captain              M S Dhoni     10500

In [36]:
# extract data by columns
df2['ODI Runs']

0    13000
1    18500
2     9000
3    10500
Name: ODI Runs, dtype: int64

In [37]:
# Take a dictionary 
studet_data={'Name':['Pranjal','Malti','Akansha','Vaishali','Bhagwat','Priti','Raunak'], 
             'Roll':[301,302,303,304,305,306,307],
            'city':['Noida','Delhi','Jaipur','Bhopal','Patna','Lucknow','Motihari'],
            'Marks':[90.2,45.2,78.5,67.8,83.9,78.5,54.9]}

In [38]:
# Show dictionary contents
studet_data

{'Name': ['Pranjal',
  'Malti',
  'Akansha',
  'Vaishali',
  'Bhagwat',
  'Priti',
  'Raunak'],
 'Roll': [301, 302, 303, 304, 305, 306, 307],
 'city': ['Noida',
  'Delhi',
  'Jaipur',
  'Bhopal',
  'Patna',
  'Lucknow',
  'Motihari'],
 'Marks': [90.2, 45.2, 78.5, 67.8, 83.9, 78.5, 54.9]}

In [39]:
# Convert dictionary to DataFrame
df5 = pd.DataFrame(studet_data)

In [40]:
df5

       Name  Roll      city  Marks
0   Pranjal   301     Noida   90.2
1     Malti   302     Delhi   45.2
2   Akansha   303    Jaipur   78.5
3  Vaishali   304    Bhopal   67.8
4   Bhagwat   305     Patna   83.9
5     Priti   306   Lucknow   78.5
6    Raunak   307  Motihari   54.9

In [41]:
# axis=1 means along the column axis which means left to right
# by default the axis is 0 which means alog row axis means downward
# to demonstrate it use axis=0 or axis='index' both are same
df5.mean(axis=0)
#df5.mean(axis='index')
# axis=1 is same as axis='columns'
#df5.mean(axis=1)
#df5.mean(axis='columns')

Roll     304.000000
Marks     71.285714
dtype: float64

In [42]:
df6 = pd.DataFrame(studet_data, index=['Rank1','Rank2','Rank3','Rank4','Rank5','Rank6','Rank7'])

In [43]:
df6

           Name  Roll      city  Marks
Rank1   Pranjal   301     Noida   90.2
Rank2     Malti   302     Delhi   45.2
Rank3   Akansha   303    Jaipur   78.5
Rank4  Vaishali   304    Bhopal   67.8
Rank5   Bhagwat   305     Patna   83.9
Rank6     Priti   306   Lucknow   78.5
Rank7    Raunak   307  Motihari   54.9

In [44]:
data = {
    'Marks-1': pd.Series([60,70,40], index=['Priti','Pankaj','Bhagwat']),
    'Marks-2': pd.Series([40,60,70,50], index=['Priti','Pankaj','Bhagwat','Pranjal'])
}
# Marks-1 has 3 data
# Marks-2 has 4 data
# Pranja is not present in Marks-1 that's why it show NaN in Marks-1 column
df1 = pd.DataFrame(data)
df1

         Marks-1  Marks-2
Bhagwat     40.0       70
Pankaj      70.0       60
Pranjal      NaN       50
Priti       60.0       40

In [45]:
# Add marks-3 column 
df1['Marks-3'] = pd.Series([20,30,60,80],index=['Priti','Pankaj','Bhagwat','Pranjal'])

In [46]:
print(df1)

         Marks-1  Marks-2  Marks-3
Bhagwat     40.0       70       60
Pankaj      70.0       60       30
Pranjal      NaN       50       80
Priti       60.0       40       20

In [47]:
df1['Total'] = df1['Marks-1']+df1['Marks-2']+df1['Marks-3']

In [48]:
df1

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70       60  170.0
Pankaj      70.0       60       30  160.0
Pranjal      NaN       50       80    NaN
Priti       60.0       40       20  120.0

In [49]:
df1['Marks-1']

Bhagwat    40.0
Pankaj     70.0
Pranjal     NaN
Priti      60.0
Name: Marks-1, dtype: float64

In [50]:
#remove column Marks-3
del df1['Marks-3']

In [51]:
# Marks-3 column has deleted
df1

         Marks-1  Marks-2  Total
Bhagwat     40.0       70  170.0
Pankaj      70.0       60  160.0
Pranjal      NaN       50    NaN
Priti       60.0       40  120.0

In [52]:
df2 = pd.DataFrame({'Marks-1':[40,50,60,70],
                    'Marks-2':[30,40,50,45],
                    'Marks-3':[90,30,45,60],
                    'Total':[160,120,155,175]
                   }, index=['Priti','Pankaj','Bhagwat','Pranjal'])
df2

         Marks-1  Marks-2  Marks-3  Total
Priti         40       30       90    160
Pankaj        50       40       30    120
Bhagwat       60       50       45    155
Pranjal       70       45       60    175

In [53]:
# merge two data set of same column name
df3 = df1.append(df2)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [54]:
df3

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  155.0
Pranjal     70.0       45     60.0  175.0

In [55]:
#concatination
df4 = pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [56]:
df4

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  155.0
Pranjal     70.0       45     60.0  175.0

# Slicing

In [57]:
#loc-----> location functtion --- fro columns
#iloc------> index location function--- for row
df4.loc['Priti']

       Marks-1  Marks-2  Marks-3  Total
Priti     60.0       40      NaN  120.0
Priti     40.0       30     90.0  160.0

In [58]:
# get contents of 3rd row
df4.iloc[3]

Marks-1     60.0
Marks-2     40.0
Marks-3      NaN
Total      120.0
Name: Priti, dtype: float64

In [59]:
# all rows and columns from 2 to 6. 7 is excluded
df4.iloc[2:7]

         Marks-1  Marks-2  Marks-3  Total
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  155.0

In [60]:
df4.loc[:'Priti']

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0

In [61]:
# slice data according column
# for all rows and column
df4.iloc[:,:]

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  155.0
Pranjal     70.0       45     60.0  175.0

In [62]:
df4.loc[['Bhagwat','Priti','Pranjal'],:]

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Bhagwat     60.0       50     45.0  155.0
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pranjal      NaN       50      NaN    NaN
Pranjal     70.0       45     60.0  175.0

In [63]:
# df4.iloc[row,column] (row and column has 3 parameters - start,stop,step)
df4.iloc[1:4,1:3]

         Marks-2  Marks-3
Pankaj        60      NaN
Pranjal       50      NaN
Priti         40      NaN

In [64]:
# Slice all except last raw i.e -1 
df4.iloc[:-1:]

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  170.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  155.0

In [65]:
# slice all column except last one
df4.iloc[:,:-1]

         Marks-1  Marks-2  Marks-3
Bhagwat     40.0       70      NaN
Pankaj      70.0       60      NaN
Pranjal      NaN       50      NaN
Priti       60.0       40      NaN
Priti       40.0       30     90.0
Pankaj      50.0       40     30.0
Bhagwat     60.0       50     45.0
Pranjal     70.0       45     60.0

In [66]:
df4.at['Priti','Total']

array([120., 160.])

In [67]:
# overwrite the value in column name Total of index Bhagwat. it means dataframe is mutable.
df4.at['Bhagwat','Total'] = 185

In [68]:
df4

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  185.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Priti       60.0       40      NaN  120.0
Priti       40.0       30     90.0  160.0
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  185.0
Pranjal     70.0       45     60.0  175.0

In [69]:
# df4 = df4.drop('Priti',axis=1) generate key error
# axis = 0 fro row
#axis = 1 for column 
df4 = df4.drop('Priti',axis=0)

In [70]:
df4

         Marks-1  Marks-2  Marks-3  Total
Bhagwat     40.0       70      NaN  185.0
Pankaj      70.0       60      NaN  160.0
Pranjal      NaN       50      NaN    NaN
Pankaj      50.0       40     30.0  120.0
Bhagwat     60.0       50     45.0  185.0
Pranjal     70.0       45     60.0  175.0

In [71]:
del df4['Marks-3']

In [72]:
df4

         Marks-1  Marks-2  Total
Bhagwat     40.0       70  185.0
Pankaj      70.0       60  160.0
Pranjal      NaN       50    NaN
Pankaj      50.0       40  120.0
Bhagwat     60.0       50  185.0
Pranjal     70.0       45  175.0

In [73]:
df4.drop('Total',axis=1)

         Marks-1  Marks-2
Bhagwat     40.0       70
Pankaj      70.0       60
Pranjal      NaN       50
Pankaj      50.0       40
Bhagwat     60.0       50
Pranjal     70.0       45

In [74]:
df4

         Marks-1  Marks-2  Total
Bhagwat     40.0       70  185.0
Pankaj      70.0       60  160.0
Pranjal      NaN       50    NaN
Pankaj      50.0       40  120.0
Bhagwat     60.0       50  185.0
Pranjal     70.0       45  175.0

In [75]:
student_data = {
    'Name':['Akansha','Vaishali','Malti','Pankaj','Raunak','Priti','Saba','Pranjal'],
    'Roll':[101,102,103,104,105,106,107,108],
    'Marks':[98.6,95.5,93.8,87.9,91.3,93.4,84.3,85.8],
    'Age':[17,18,17,19,16,19,18,17]
}
df = pd.DataFrame(student_data,index=[6,5,7,4,1,3,2,0])

In [76]:
df

       Name  Roll  Marks  Age
6   Akansha   101   98.6   17
5  Vaishali   102   95.5   18
7     Malti   103   93.8   17
4    Pankaj   104   87.9   19
1    Raunak   105   91.3   16
3     Priti   106   93.4   19
2      Saba   107   84.3   18
0   Pranjal   108   85.8   17

In [77]:
df.T

             6         5      7       4       1      3     2        0
Name   Akansha  Vaishali  Malti  Pankaj  Raunak  Priti  Saba  Pranjal
Roll       101       102    103     104     105    106   107      108
Marks     98.6      95.5   93.8    87.9    91.3   93.4  84.3     85.8
Age         17        18     17      19      16     19    18       17

In [78]:
df.axes

[Int64Index([6, 5, 7, 4, 1, 3, 2, 0], dtype='int64'),
 Index(['Name', 'Roll', 'Marks', 'Age'], dtype='object')]

In [79]:
df.columns

Index(['Name', 'Roll', 'Marks', 'Age'], dtype='object')

In [80]:
df.shape

(8, 4)

In [81]:
df.ndim

2

In [82]:
df.dtypes

Name      object
Roll       int64
Marks    float64
Age        int64
dtype: object

In [83]:
df.size

32

In [84]:
#convert DataFrame into numpy array
df.values

array([['Akansha', 101, 98.6, 17],
       ['Vaishali', 102, 95.5, 18],
       ['Malti', 103, 93.8, 17],
       ['Pankaj', 104, 87.9, 19],
       ['Raunak', 105, 91.3, 16],
       ['Priti', 106, 93.4, 19],
       ['Saba', 107, 84.3, 18],
       ['Pranjal', 108, 85.8, 17]], dtype=object)

In [85]:
df.head()

       Name  Roll  Marks  Age
6   Akansha   101   98.6   17
5  Vaishali   102   95.5   18
7     Malti   103   93.8   17
4    Pankaj   104   87.9   19
1    Raunak   105   91.3   16

In [86]:
df.tail()

      Name  Roll  Marks  Age
4   Pankaj   104   87.9   19
1   Raunak   105   91.3   16
3    Priti   106   93.4   19
2     Saba   107   84.3   18
0  Pranjal   108   85.8   17

In [87]:
df.sum()

Name     AkanshaVaishaliMaltiPankajRaunakPritiSabaPranjal
Roll                                                  836
Marks                                               730.6
Age                                                   141
dtype: object

In [88]:
df.sum(axis=1)

6    216.6
5    215.5
7    213.8
4    210.9
1    212.3
3    218.4
2    209.3
0    210.8
dtype: float64

In [89]:
df.mean()

Roll     104.500
Marks     91.325
Age       17.625
dtype: float64

In [90]:
df1.mean()

Marks-1     56.666667
Marks-2     55.000000
Total      150.000000
dtype: float64

In [91]:
df.median()

Roll     104.50
Marks     92.35
Age       17.50
dtype: float64

In [92]:
# Example picture is given on the bottom of this page 
df.std()

Roll     2.449490
Marks    4.962646
Age      1.060660
dtype: float64

In [93]:
df.count()

Name     8
Roll     8
Marks    8
Age      8
dtype: int64

In [94]:
df1.count()

Marks-1    3
Marks-2    4
Total      3
dtype: int64

In [95]:
df.max()

Name     Vaishali
Roll          108
Marks        98.6
Age            19
dtype: object

In [96]:
df.min()

Name     Akansha
Roll         101
Marks       84.3
Age           16
dtype: object

In [97]:
df.describe()

            Roll      Marks       Age
count    8.00000   8.000000   8.00000
mean   104.50000  91.325000  17.62500
std      2.44949   4.962646   1.06066
min    101.00000  84.300000  16.00000
25%    102.75000  87.375000  17.00000
50%    104.50000  92.350000  17.50000
75%    106.25000  94.225000  18.25000
max    108.00000  98.600000  19.00000

In [98]:
df5 = df.describe()

In [99]:
df5

            Roll      Marks       Age
count    8.00000   8.000000   8.00000
mean   104.50000  91.325000  17.62500
std      2.44949   4.962646   1.06066
min    101.00000  84.300000  16.00000
25%    102.75000  87.375000  17.00000
50%    104.50000  92.350000  17.50000
75%    106.25000  94.225000  18.25000
max    108.00000  98.600000  19.00000

In [100]:
df5.at['25%','Roll']

102.75

In [101]:
df.sample(3)

       Name  Roll  Marks  Age
7     Malti   103   93.8   17
5  Vaishali   102   95.5   18
3     Priti   106   93.4   19

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 6 to 0
Data columns (total 4 columns):
Name     8 non-null object
Roll     8 non-null int64
Marks    8 non-null float64
Age      8 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 640.0+ bytes

In [103]:
# sort by index
df.sort_index()

       Name  Roll  Marks  Age
0   Pranjal   108   85.8   17
1    Raunak   105   91.3   16
2      Saba   107   84.3   18
3     Priti   106   93.4   19
4    Pankaj   104   87.9   19
5  Vaishali   102   95.5   18
6   Akansha   101   98.6   17
7     Malti   103   93.8   17

In [104]:
df.sort_index(ascending=False)

       Name  Roll  Marks  Age
7     Malti   103   93.8   17
6   Akansha   101   98.6   17
5  Vaishali   102   95.5   18
4    Pankaj   104   87.9   19
3     Priti   106   93.4   19
2      Saba   107   84.3   18
1    Raunak   105   91.3   16
0   Pranjal   108   85.8   17

In [105]:
df.sort_values(by='Name')

       Name  Roll  Marks  Age
6   Akansha   101   98.6   17
7     Malti   103   93.8   17
4    Pankaj   104   87.9   19
0   Pranjal   108   85.8   17
3     Priti   106   93.4   19
1    Raunak   105   91.3   16
2      Saba   107   84.3   18
5  Vaishali   102   95.5   18

In [106]:
df.sort_values(by='Roll')

       Name  Roll  Marks  Age
6   Akansha   101   98.6   17
5  Vaishali   102   95.5   18
7     Malti   103   93.8   17
4    Pankaj   104   87.9   19
1    Raunak   105   91.3   16
3     Priti   106   93.4   19
2      Saba   107   84.3   18
0   Pranjal   108   85.8   17

In [107]:
df.sort_values('Marks',ascending=False)

       Name  Roll  Marks  Age
6   Akansha   101   98.6   17
5  Vaishali   102   95.5   18
7     Malti   103   93.8   17
3     Priti   106   93.4   19
1    Raunak   105   91.3   16
4    Pankaj   104   87.9   19
0   Pranjal   108   85.8   17
2      Saba   107   84.3   18

In [108]:
# sort firstly according to age and then according to name
df.sort_values(by = ['Age','Name'])

       Name  Roll  Marks  Age
1    Raunak   105   91.3   16
6   Akansha   101   98.6   17
7     Malti   103   93.8   17
0   Pranjal   108   85.8   17
2      Saba   107   84.3   18
5  Vaishali   102   95.5   18
4    Pankaj   104   87.9   19
3     Priti   106   93.4   19

In [109]:
#extract only one name not all details of those who has got maximum marks
df = df.sort_values(by = 'Marks',ascending = False)
df.iloc[:1,:1]

      Name
6  Akansha

In [110]:
# we use rename function to concatinate two data sets or merge it we have to sure that the columns name are same
df2=df.rename(columns={'Name':'Student_Name','Marks':'Average_Marks'},
             index={6:'Topper'})

In [111]:
df2

       Student_Name  Roll  Average_Marks  Age
Topper      Akansha   101           98.6   17
5          Vaishali   102           95.5   18
7             Malti   103           93.8   17
3             Priti   106           93.4   19
1            Raunak   105           91.3   16
4            Pankaj   104           87.9   19
0           Pranjal   108           85.8   17
2              Saba   107           84.3   18

In [112]:
student_data = {
    'Name':['Akansha','Vaishali','Malti','Pankaj','Raunak','Priti','Saba','Pranjal','Anshu','Muskan'],
    'Roll':[101,102,103,104,105,106,107,108,111,112],
    'Marks':[98.6,95.5,93.8,87.9,91.3,93.4,84.3,85.8,89.9,99.8],
    'Age':[17,18,17,19,16,19,18,17,17,19],
    'Branch':['CSE','IT','ECE','IT','ECE','CSE','CSE','IT','ECE','CSE'],
    'Passing_year':[2021,2022,2021,2023,2023,2022,2022,2021,2022,2021]
}

In [113]:
df = pd.DataFrame(student_data)
df

       Name  Roll  Marks  Age Branch  Passing_year
0   Akansha   101   98.6   17    CSE          2021
1  Vaishali   102   95.5   18     IT          2022
2     Malti   103   93.8   17    ECE          2021
3    Pankaj   104   87.9   19     IT          2023
4    Raunak   105   91.3   16    ECE          2023
5     Priti   106   93.4   19    CSE          2022
6      Saba   107   84.3   18    CSE          2022
7   Pranjal   108   85.8   17     IT          2021
8     Anshu   111   89.9   17    ECE          2022
9    Muskan   112   99.8   19    CSE          2021

In [114]:
df.groupby('Branch').groups

{'CSE': Int64Index([0, 5, 6, 9], dtype='int64'),
 'ECE': Int64Index([2, 4, 8], dtype='int64'),
 'IT': Int64Index([1, 3, 7], dtype='int64')}

In [115]:
df.groupby('Branch').size()

Branch
CSE    4
ECE    3
IT     3
dtype: int64

In [116]:
df.groupby('Branch').count()

        Name  Roll  Marks  Age  Passing_year
Branch
CSE        4     4      4    4             4
ECE        3     3      3    3             3
IT         3     3      3    3             3

In [117]:
group1 = df.groupby('Branch')
for name , data in group1:
    print(name)
    print(data)

CSE
      Name  Roll  Marks  Age Branch  Passing_year
0  Akansha   101   98.6   17    CSE          2021
5    Priti   106   93.4   19    CSE          2022
6     Saba   107   84.3   18    CSE          2022
9   Muskan   112   99.8   19    CSE          2021
ECE
     Name  Roll  Marks  Age Branch  Passing_year
2   Malti   103   93.8   17    ECE          2021
4  Raunak   105   91.3   16    ECE          2023
8   Anshu   111   89.9   17    ECE          2022
IT
       Name  Roll  Marks  Age Branch  Passing_year
1  Vaishali   102   95.5   18     IT          2022
3    Pankaj   104   87.9   19     IT          2023
7   Pranjal   108   85.8   17     IT          2021

In [118]:
df.groupby('Passing_year').size()

Passing_year
2021    4
2022    4
2023    2
dtype: int64

In [119]:
group2 =df.groupby('Passing_year')
for name, data in group2:
    print(name)
    print(data)

2021
      Name  Roll  Marks  Age Branch  Passing_year
0  Akansha   101   98.6   17    CSE          2021
2    Malti   103   93.8   17    ECE          2021
7  Pranjal   108   85.8   17     IT          2021
9   Muskan   112   99.8   19    CSE          2021
2022
       Name  Roll  Marks  Age Branch  Passing_year
1  Vaishali   102   95.5   18     IT          2022
5     Priti   106   93.4   19    CSE          2022
6      Saba   107   84.3   18    CSE          2022
8     Anshu   111   89.9   17    ECE          2022
2023
     Name  Roll  Marks  Age Branch  Passing_year
3  Pankaj   104   87.9   19     IT          2023
4  Raunak   105   91.3   16    ECE          2023

In [120]:
group2 =df.groupby(['Passing_year','Branch'])
for name, data in group2:
    print(name)
    print(data)

(2021, 'CSE')
      Name  Roll  Marks  Age Branch  Passing_year
0  Akansha   101   98.6   17    CSE          2021
9   Muskan   112   99.8   19    CSE          2021
(2021, 'ECE')
    Name  Roll  Marks  Age Branch  Passing_year
2  Malti   103   93.8   17    ECE          2021
(2021, 'IT')
      Name  Roll  Marks  Age Branch  Passing_year
7  Pranjal   108   85.8   17     IT          2021
(2022, 'CSE')
    Name  Roll  Marks  Age Branch  Passing_year
5  Priti   106   93.4   19    CSE          2022
6   Saba   107   84.3   18    CSE          2022
(2022, 'ECE')
    Name  Roll  Marks  Age Branch  Passing_year
8  Anshu   111   89.9   17    ECE          2022
(2022, 'IT')
       Name  Roll  Marks  Age Branch  Passing_year
1  Vaishali   102   95.5   18     IT          2022
(2023, 'ECE')
     Name  Roll  Marks  Age Branch  Passing_year
4  Raunak   105   91.3   16    ECE          2023
(2023, 'IT')
     Name  Roll  Marks  Age Branch  Passing_year
3  Pankaj   104   87.9   19     IT          2023

# Join Data set

In [121]:
student_data={
    'Roll':[101,102,103,104,105,106,107],
    'Name':['Akansha','Vaishali','Malti','Pankaj','Raunak','Priti','Pranjal'],
}
df1=pd.DataFrame(student_data)
df1

   Roll      Name
0   101   Akansha
1   102  Vaishali
2   103     Malti
3   104    Pankaj
4   105    Raunak
5   106     Priti
6   107   Pranjal

In [122]:
marksdata={
    'Roll':[101,102,103,104,111,116,112],
     'Marks':[98.6,95.5,93.8,87.9,91.3,93.4,84.3]
}
df2=pd.DataFrame(marksdata)
df2

   Roll  Marks
0   101   98.6
1   102   95.5
2   103   93.8
3   104   87.9
4   111   91.3
5   116   93.4
6   112   84.3

In [123]:
# merge data having same roll numbers
# we can also do it by using .join
#reference of pandas.DataFrame.join is given below

#common roll in both dataframe will be merged
# you can say an intersection of df1 and df2 or inner join
# by default it is inner join so we don't have need to specify it
df3 = df1.merge(df2, on = 'Roll')

In [124]:
df3

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9

In [125]:
# left join means it will take all the common elements between the two sets
# and also the remaining elements from the left DataFrame
df4 = df1.merge(df2, on = 'Roll',how = 'left')
df4

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    NaN
5   106     Priti    NaN
6   107   Pranjal    NaN

In [126]:
# Right join means it will take all the common elements between the two sets
# and also the remaining elements from the Right DataFrame
df5 =df1.merge(df2, on='Roll',how='right')
df5

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   111       NaN   91.3
5   116       NaN   93.4
6   112       NaN   84.3

In [127]:
# outer join is same as union of df1 and df2
# use indicator to see where it comes from
# A extra column will be added which show how it merged the two dataframes
#df6 =df1.merge(df2, on='Roll',how='outer', indicator=True)
df6 =df1.merge(df2, on='Roll',how='outer')
df6

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    NaN
5   106     Priti    NaN
6   107   Pranjal    NaN
7   111       NaN   91.3
8   116       NaN   93.4
9   112       NaN   84.3

In [128]:
df7=df6.sort_values(by='Roll')

In [129]:
df7

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    NaN
5   106     Priti    NaN
6   107   Pranjal    NaN
7   111       NaN   91.3
9   112       NaN   84.3
8   116       NaN   93.4

In [130]:
# it will show true in missing values
df7.isna()

    Roll   Name  Marks
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True
6  False  False   True
7  False   True  False
9  False   True  False
8  False   True  False

In [131]:
df7.isna().sum()

Roll     0
Name     3
Marks    3
dtype: int64

In [132]:
# incounter the missing values
# fill this data with some value
df6.fillna(0)

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    0.0
5   106     Priti    0.0
6   107   Pranjal    0.0
7   111         0   91.3
8   116         0   93.4
9   112         0   84.3

In [133]:
df7['Marks']=df7['Marks'].fillna(df7['Marks'].mean())

In [134]:
df7

   Roll      Name      Marks
0   101   Akansha  98.600000
1   102  Vaishali  95.500000
2   103     Malti  93.800000
3   104    Pankaj  87.900000
4   105    Raunak  92.114286
5   106     Priti  92.114286
6   107   Pranjal  92.114286
7   111       NaN  91.300000
9   112       NaN  84.300000
8   116       NaN  93.400000

In [135]:
df7['Marks'] = df7['Marks'].fillna(df7['Marks'].median())

In [136]:
df7

   Roll      Name      Marks
0   101   Akansha  98.600000
1   102  Vaishali  95.500000
2   103     Malti  93.800000
3   104    Pankaj  87.900000
4   105    Raunak  92.114286
5   106     Priti  92.114286
6   107   Pranjal  92.114286
7   111       NaN  91.300000
9   112       NaN  84.300000
8   116       NaN  93.400000

In [137]:
df6

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    NaN
5   106     Priti    NaN
6   107   Pranjal    NaN
7   111       NaN   91.3
8   116       NaN   93.4
9   112       NaN   84.3

In [138]:
# forward fill
df6.fillna(method='ffill')

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak   87.9
5   106     Priti   87.9
6   107   Pranjal   87.9
7   111   Pranjal   91.3
8   116   Pranjal   93.4
9   112   Pranjal   84.3

In [139]:
# back fill
df6.fillna(method='bfill')

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak   91.3
5   106     Priti   91.3
6   107   Pranjal   91.3
7   111       NaN   91.3
8   116       NaN   93.4
9   112       NaN   84.3

In [140]:
df6

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9
4   105    Raunak    NaN
5   106     Priti    NaN
6   107   Pranjal    NaN
7   111       NaN   91.3
8   116       NaN   93.4
9   112       NaN   84.3

In [141]:
#drop all rows having missing values
df6.dropna()

   Roll      Name  Marks
0   101   Akansha   98.6
1   102  Vaishali   95.5
2   103     Malti   93.8
3   104    Pankaj   87.9

In [142]:
# Drop columns having missing values
df6.dropna(axis=1)

   Roll
0   101
1   102
2   103
3   104
4   105
5   106
6   107
7   111
8   116
9   112

In [143]:
df

       Name  Roll  Marks  Age Branch  Passing_year
0   Akansha   101   98.6   17    CSE          2021
1  Vaishali   102   95.5   18     IT          2022
2     Malti   103   93.8   17    ECE          2021
3    Pankaj   104   87.9   19     IT          2023
4    Raunak   105   91.3   16    ECE          2023
5     Priti   106   93.4   19    CSE          2022
6      Saba   107   84.3   18    CSE          2022
7   Pranjal   108   85.8   17     IT          2021
8     Anshu   111   89.9   17    ECE          2022
9    Muskan   112   99.8   19    CSE          2021

In [144]:
df.to_csv('Student.csv')
print('Data Saved')

Data Saved

In [145]:
#index will be removed
df.to_csv('Student_without_index.csv', index=False)

In [146]:
#read data file 
mydata=pd.read_csv("Student_without_index.csv")

In [147]:
mydata

       Name  Roll  Marks  Age Branch  Passing_year
0   Akansha   101   98.6   17    CSE          2021
1  Vaishali   102   95.5   18     IT          2022
2     Malti   103   93.8   17    ECE          2021
3    Pankaj   104   87.9   19     IT          2023
4    Raunak   105   91.3   16    ECE          2023
5     Priti   106   93.4   19    CSE          2022
6      Saba   107   84.3   18    CSE          2022
7   Pranjal   108   85.8   17     IT          2021
8     Anshu   111   89.9   17    ECE          2022
9    Muskan   112   99.8   19    CSE          2021

In [148]:
# save on another location
mydata.to_csv("D:\\PyBasic-Session-01\\Pandas_tutorial\\Another Location\\student.csv", index=False)

In [149]:
data=pd.read_csv("D:\\PyBasic-Session-01\\Pandas_tutorial\\Another Location\\student.csv")

In [150]:
data

       Name  Roll  Marks  Age Branch  Passing_year
0   Akansha   101   98.6   17    CSE          2021
1  Vaishali   102   95.5   18     IT          2022
2     Malti   103   93.8   17    ECE          2021
3    Pankaj   104   87.9   19     IT          2023
4    Raunak   105   91.3   16    ECE          2023
5     Priti   106   93.4   19    CSE          2022
6      Saba   107   84.3   18    CSE          2022
7   Pranjal   108   85.8   17     IT          2021
8     Anshu   111   89.9   17    ECE          2022
9    Muskan   112   99.8   19    CSE          2021

In [151]:
data = pd.read_excel("D:\\945-Jeevan-Umang Plan LIC.xlsx")

In [152]:
data.head(5)

  Plan Name: 945-Jeevan Umang Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0                Age: 20 Year        NaN        NaN        NaN        NaN
1               Anual Premium      50000        NaN        NaN        NaN
2         Premium Paying Term   15 Years   20 Years   25 Years   30 Years
3             Return Per Year      50000      74000     102000     132000
4                    Maturity    6193750    8796750   11513250   14107500

In [153]:
# Rename columns by passing old name as key and new name as value in dictionary
data.rename(columns = {'Unnamed: 1':'Plan 1','Unnamed: 2':'Plan 2','Unnamed: 3':'Plan 3','Unnamed: 4':'Plan 4'})
# You can also do it as
#data.columns=['Plan Name','Plan 1','Plan 2','Plan 3','Plan 4']
data.columns

Index(['Plan Name: 945-Jeevan Umang', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3',
       'Unnamed: 4'],
      dtype='object')

In [154]:
data.head()

  Plan Name: 945-Jeevan Umang Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0                Age: 20 Year        NaN        NaN        NaN        NaN
1               Anual Premium      50000        NaN        NaN        NaN
2         Premium Paying Term   15 Years   20 Years   25 Years   30 Years
3             Return Per Year      50000      74000     102000     132000
4                    Maturity    6193750    8796750   11513250   14107500

In [155]:
# read data from another sheet of same workbook in excel
st2_data = pd.read_excel("D:\\945-Jeevan-Umang Plan LIC.xlsx",sheet_name="Sheet2")

In [156]:
st2_data

  Plan Name: 945-Jeevan Umang Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0                Age: 25 Year        NaN        NaN        NaN        NaN
1               Anual Premium      50000        NaN        NaN        NaN
2         Premium Paying Term   15 Years   20 Years   25 Years   30 Years
3             Return Per Year      50000      74000     102000     132000
4                    Maturity    5984375    8510000   11156250   13487500
5                 Sum Assured     625000    9250500     127500    1625000
6               Total Premium     759303    1015195    1260834    1507525
7                Total Return    8984375   12580000   16256250   19337500

In [157]:
st2_data.columns = ['Plan Name','Plan 1','Plan 2','Plan 3','Plan 4']
st2_data.columns

Index(['Plan Name', 'Plan 1', 'Plan 2', 'Plan 3', 'Plan 4'], dtype='object')

In [158]:
st2_data.head()

             Plan Name    Plan 1    Plan 2    Plan 3    Plan 4
0         Age: 25 Year       NaN       NaN       NaN       NaN
1        Anual Premium     50000       NaN       NaN       NaN
2  Premium Paying Term  15 Years  20 Years  25 Years  30 Years
3      Return Per Year     50000     74000    102000    132000
4             Maturity   5984375   8510000  11156250  13487500

# Create a excel file and merge the data of two sheets and save that data into a csv file

In [159]:
# Read data of sheet 1
st1 = pd.read_excel("F:\\ML Traning IIT,k (SS)\\Dataset\\Data_set.xlsx",sheet_name="Sheet1")

In [160]:
# Read data of sheet 2
st2 = pd.read_excel("F:\\ML Traning IIT,k (SS)\\Dataset\\Data_set.xlsx",sheet_name='Sheet2')

In [161]:
st1

   Roll    Name  Marks
0   101    Amit     98
1   102   Ashok     87
2   103  Ashish     78
3   104   Nitin     89
4   105  Gautam     91
5   106  Manish     88
6   107  Krishn     86
7   108  Subham     74

In [162]:
st2

   Roll Branch
0   101    CSE
1   102     IT
2   103    ECE
3   104    EEE
4   105    CSE
5   106     IT
6   107    ECE
7   108    CSE

In [163]:
# Meerg both sheet and store it into a new object
newcsv=st1.merge(st2, on='Roll')

In [164]:
newcsv

   Roll    Name  Marks Branch
0   101    Amit     98    CSE
1   102   Ashok     87     IT
2   103  Ashish     78    ECE
3   104   Nitin     89    EEE
4   105  Gautam     91    CSE
5   106  Manish     88     IT
6   107  Krishn     86    ECE
7   108  Subham     74    CSE

In [165]:
# Save merged file on another location
newcsv.to_csv("F:\\ML Traning IIT,k (SS)\\Data_set2.csv",index=False)

In [166]:
# Read the saved merged file
csvdata=pd.read_csv("F:\\ML Traning IIT,k (SS)\\Data_set2.csv")

In [167]:
csvdata

   Roll    Name  Marks Branch
0   101    Amit     98    CSE
1   102   Ashok     87     IT
2   103  Ashish     78    ECE
3   104   Nitin     89    EEE
4   105  Gautam     91    CSE
5   106  Manish     88     IT
6   107  Krishn     86    ECE
7   108  Subham     74    CSE

In [168]:
import pymysql

In [169]:
# Read data form mysql
conn = pymysql.connect(host='localhost', user='root',password='password', database='database_name')

In [170]:
stud_data=pd.read_sql("Select * from table_name", conn)

In [171]:
stud_data

                 name   roll branch       College  passingYr  age
0         Ankit Kumar  17301    CSE  MCE Motihari       2021   20
1      Intekhab Ahmad  17302    CSE  MCE Motihari       2021   21
2        Sudhir Kumar  17303    CSE  MCE Motihari       2021   20
3    Saurav Kumar Jha  17306    CSE  MCE Motihari       2021   21
4     Krishn Kant Raj  17307    CSE  MCE Motihari       2021   21
5        Manish Kumar  17308    CSE  MCE Motihari       2021   20
6              Preeti  17309    CSE  MCE Motihari       2021   20
7       Satyam Ranjan  17310    CSE  MCE Motihari       2021   20
8   Rahul Kumar singh  17311    CSE  MCE Motihari       2021   22
9      Taufique Anwar  17312    CSE  MCE Motihari       2021   23
10    Kumari Priyanka  17313    CSE  MCE Motihari       2021   24

In [172]:
# you can perform all above operations on this data
stud_data.sort_values(by = 'name')

                 name   roll branch       College  passingYr  age
0         Ankit Kumar  17301    CSE  MCE Motihari       2021   20
1      Intekhab Ahmad  17302    CSE  MCE Motihari       2021   21
4     Krishn Kant Raj  17307    CSE  MCE Motihari       2021   21
10    Kumari Priyanka  17313    CSE  MCE Motihari       2021   24
5        Manish Kumar  17308    CSE  MCE Motihari       2021   20
6              Preeti  17309    CSE  MCE Motihari       2021   20
8   Rahul Kumar singh  17311    CSE  MCE Motihari       2021   22
7       Satyam Ranjan  17310    CSE  MCE Motihari       2021   20
3    Saurav Kumar Jha  17306    CSE  MCE Motihari       2021   21
2        Sudhir Kumar  17303    CSE  MCE Motihari       2021   20
9      Taufique Anwar  17312    CSE  MCE Motihari       2021   23